In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame()

In [3]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [4]:
df1 = pd.DataFrame([[1, 2, 3, 4], [5, 6, 7 ,8], [10 ,45, 456, 78], [55, 65 ,12, 232]])

In [5]:
df1

    0   1    2    3
0   1   2    3    4
1   5   6    7    8
2  10  45  456   78
3  55  65   12  232

In [6]:
df1.head(2)  # This wil print the starting two Rows

   0  1  2  3
0  1  2  3  4
1  5  6  7  8

In [7]:
df1.tail(2)  # This wil print the ending two Rows

    0   1    2    3
2  10  45  456   78
3  55  65   12  232